
# nc: 10  
# scales:
#   n: [0.50, 0.25, 1024]

# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-
#   - [-1, 1, FDD, [128]]               # 1
#   - [-1, 3, RexC3k2, [128, True, 0.25]] # 2
#   - [-1, 1, FDD, [256]]               # 3
#   - [-1, 6, RexC3k2, [256, True, 0.25]] # 4
#   - [-1, 1, FDD, [512]]               # 5
#   - [-1, 6, RexC3k2, [512, True, 0.25]] # 6
#   - [-1, 1, FPSPP, [512]]              # 7
# head:
#   - [4, 1, Conv, [128, 1]]     # 8:
#   - [7, 1, Conv, [256, 1]]     # 9

#   - [-1, 1, DySample, []]      # 10
#   - [[-1, 8], 1, Concat, [1]]  # 11
#   - [-1, 2, C3k2, [256, False]] # 12
#   - [[9, 8, 2], 1, IndirectlyPathContextGuide, []]
#   - [12, 1, Conv, [128, 1, 1]]
#   - [-1, 1, DySample, []]
#   - [[-1, 13], 1, Concat, [1]]
#   - [-1, 2, C3k2, [128, False]]
#   - [12, 1, Conv, [256, 3, 2]] 
#   - [[-1, 9], 1, Concat, [1]]  
#   - [-1, 2, C3k2, [512, False]] 

#   - [[17, 12, 20], 1, Detect, [nc]] # 21

# head:
#   - [4, 1, Conv, [128, 1]]
#   - [7, 1, Conv, [256, 1]]

#   - [-1, 1, DySample, []]       # 10
#   - [[-1, 8], 1, Concat, [1]]   # 11
#   - [-1, 2, C3k2, [256, True]] # 12:

#   - [-1, 1, Conv, [128, 1, 1]] # 13
#   - [-1, 1, DySample, []]       # 14
#   - [[-1, 2], 1, Concat, [1]]   # 15
#   - [-1, 2, C3k2, [128, False]]

#   - [12, 1, Conv, [256, 3, 2]]  
#   - [[-1, 9], 1, Concat, [1]]   
#   - [-1, 2, C3k2, [512, True]] 

#   - [[16, 12, 19], 1, Detect, [nc]] # 20


#   - [-1, 1, Conv, [128, 1, 1]] # 13
#   - [-1, 1, DySample, []]      # 14
#   - [9, 1, DySample, [4]] # 15
#   - [[2, 14, 15], 1, Concat, [1]] # 16
#   - [-1, 2, C3k2, [128, False]]   # 17

#   - [12, 1, Conv, [256, 3, 2]]  # 18
#   - [[-1, 9], 1, Concat, [1]]   # 19
#   - [-1, 2, C3k2, [512, True]]  # 20

#   - [[17, 12, 20], 1, Detect, [nc]]

nc: 10  
scales:
  n: [0.50, 0.25, 1024] # Nano cực nhẹ, train batch size to vô tư

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0
  - [-1, 1, FDD, [128]]               # 1
  - [-1, 3, RexC3k2, [128, True, 0.25]] # 2 (P2 Orig)
  - [-1, 1, FDD, [256]]               # 3
  - [-1, 6, RexC3k2, [256, True, 0.25]] # 4 (P3 Orig)
  - [-1, 1, FDD, [512]]               # 5
  - [-1, 6, RexC3k2, [512, True, 0.25]] # 6 (P4 Orig)
  - [-1, 1, FPSPP, [512]]         # 7 (Dùng khối SPPF mới để ko lọt điểm ảnh)
  

head:
  # ==========================================
  # PHẦN 1: TOP-DOWN (Truyền bối cảnh xuống)
  # ==========================================
  - [4, 1, Conv, [128, 1]]      # 8: P3 reduced
  - [7, 1, Conv, [256, 1]]      # 9: P4 reduced

  - [-1, 1, DySample, []]       # 10: P4_up
  - [[-1, 8], 1, Concat, [1]]   # 11
  - [-1, 2, C3k2, [256, False]] # 12: P3 fused

  # Khối ICG dẫn đường từ P4(9) và P3(8) chiếu xuống P2(2)
  - [[9, 8, 2], 1, IndirectlyPathContextGuide, []] # 13: Masked P2

  - [12, 1, Conv, [128, 1, 1]]  # 14: P3 fused reduced
  - [-1, 1, DySample, []]       # 15: P3_fused_up
  - [[-1, 13], 1, Concat, [1]]  # 16: Trộn P3 up + ICG Mask
  - [-1, 2, C3k2, [128, False]] # 17: P2 Final (DETECT ĐƯỢC RỒI)

  # ==========================================
  # PHẦN 2: BOTTOM-UP (Phục hồi chi tiết viền)
  # ==========================================
  # Từ P2 (17) truyền ngược lên P3
  - [-1, 1, Conv, [128, 3, 2]]  # 18: Ép P2 nhỏ lại
  - [[-1, 12], 1, Concat, [1]]  # 19: Nối P2_down (128) + P3_fused (256) = 384 kênh
  - [-1, 2, C3k2, [256, False]] # 20: P3 Final (DETECT ĐƯỢC RỒI)

  # Từ P3 (20) truyền ngược lên P4
  - [-1, 1, Conv, [256, 3, 2]]  # 21: Ép P3 nhỏ lại
  - [[-1, 9], 1, Concat, [1]]   # 22: Nối P3_down (256) + P4_reduced (256) = 512 kênh
  - [-1, 2, C3k2, [512, False]] # 23: P4 Final (DETECT ĐƯỢC RỒI)

  # Đưa chuẩn 3 kích thước [P2, P3, P4] vào Detect
  - [[17, 20, 23], 1, Detect, [nc]] # 24