
nc: 10  
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-
  - [-1, 1, FDD, [128]]               # 1
  - [-1, 3, RexC3k2, [128, True, 0.25]] # 2
  - [-1, 1, FDD, [256]]               # 3
  - [-1, 6, RexC3k2, [256, True, 0.25]] # 4
  - [-1, 1, FDD, [512]]               # 5
  - [-1, 6, RexC3k2, [512, True, 0.25]] # 6
  - [-1, 1, FPSPP, [512]]              # 7
head:
  - [4, 1, Conv, [128, 1]]     # 8:
  - [7, 1, Conv, [256, 1]]     # 9

  - [-1, 1, DySample, []]      # 10
  - [[-1, 8], 1, Concat, [1]]  # 11
  - [-1, 2, C3k2, [256, False]] # 12
  - [[9, 8, 2], 1, IndirectlyPathContextGuide, []]
  - [12, 1, Conv, [128, 1, 1]]
  - [-1, 1, DySample, []]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]
  - [12, 1, Conv, [256, 3, 2]] 
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 2, C3k2, [512, False]] 

  - [[17, 12, 20], 1, Detect, [nc]] # 21

# head:
#   - [4, 1, Conv, [128, 1]]
#   - [7, 1, Conv, [256, 1]]

#   - [-1, 1, DySample, []]       # 10
#   - [[-1, 8], 1, Concat, [1]]   # 11
#   - [-1, 2, C3k2, [256, True]] # 12:

#   - [-1, 1, Conv, [128, 1, 1]] # 13
#   - [-1, 1, DySample, []]       # 14
#   - [[-1, 2], 1, Concat, [1]]   # 15
#   - [-1, 2, C3k2, [128, False]]

#   - [12, 1, Conv, [256, 3, 2]]  
#   - [[-1, 9], 1, Concat, [1]]   
#   - [-1, 2, C3k2, [512, True]] 

#   - [[16, 12, 19], 1, Detect, [nc]] # 20


#   - [-1, 1, Conv, [128, 1, 1]] # 13
#   - [-1, 1, DySample, []]      # 14
#   - [9, 1, DySample, [4]] # 15
#   - [[2, 14, 15], 1, Concat, [1]] # 16
#   - [-1, 2, C3k2, [128, False]]   # 17

#   - [12, 1, Conv, [256, 3, 2]]  # 18
#   - [[-1, 9], 1, Concat, [1]]   # 19
#   - [-1, 2, C3k2, [512, True]]  # 20

#   - [[17, 12, 20], 1, Detect, [nc]]
