# Asymmetric Dense PANet (ADPANet) intergrating with DWT
# SRS-YOLO: Lightweight Asymmetric Dense PANet for VisDrone2019
# Proposed Architecture for UAV Small Object Detection

nc: 10  # Số lượng class của tập VisDrone2019
scales:
  n: [0.50, 0.25, 1024] # Cấu hình scale (tương tự YOLOv8n / YOLO11n)

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, FDD, [128]]               # 1-P2/4: Khối FDD khử nhiễu tần số
  - [-1, 3, RFC3k2, [128, 0.5]] # 2: Output P2 Backbone (Giữ nguyên C3k2 ở đây để tránh dư thừa tham số)  
  - [-1, 1, FDD, [256]]               # 3-P3/8
  - [-1, 6, RFC3k2, [256, 0.5]] # 4: Output P3 Backbone

  - [-1, 1, FDD, [512]]               # 5-P4/16
  - [-1, 6, RFC3k2, [512, 0.5]] # 6: Tiền xử lý P4
  - [-1, 1, SPPF, [512]]              # 7: Output P4 Backbone (Thay SPPF bằng MSFP để lấy trường nhìn đa tỷ lệ)

head:
  - [4, 1, Conv, [128, 1]]
  - [7, 1, Conv, [256, 1]]

  - [-1, 1, DySample, []]       # 10
  - [[-1, 8], 1, Concat, [1]]   # 11
  - [-1, 2, C3k2, [256, False]] # 12: SMALL HEAD (256 kênh)

  - [-1, 1, Conv, [128, 1, 1]] # 13
  - [-1, 1, DySample, []]       # 14
  - [[-1, 2], 1, Concat, [1]]   # 15
  - [-1, 2, C3k2, [128, False]] # 16: TINY HEAD (128 kênh)

  - [12, 1, Conv, [256, 3, 2]]  # 17: Hạ mẫu từ Small Head
  - [[-1, 9], 1, Concat, [1]]   # 18
  - [-1, 2, C3k2, [512, False]] # 19: MEDIUM HEAD (512 kênh)

  - [[16, 12, 19], 1, Detect, [nc]] # 20