<<<<<<< HEAD
nc: 80
=======
nc: 10
>>>>>>> a85b608541808a59c7235557facc85df239f31da
scales:
  n: [0.50, 0.25, 1024] 
  # s: [0.50, 0.50, 1024]

backbone:
<<<<<<< HEAD
  - [-1, 1, Conv, [64, 3, 2]]         
  - [-1, 1, FDD, [128]]               
  - [-1, 3, C3k2, [128, False, 0.25]] 
  # - [-1, 3, C3k2_GhostV2, [128, False, 1, 0.25, 'original']]
  - [-1, 1, FDD, [256]]               
  - [-1, 6, C3k2, [256, False, 0.25]] 
  # - [-1, 6, C3k2_GhostV2, [256, False, 1, 0.25, 'attn']]
  - [-1, 1, FDD, [512]]               
  - [-1, 6, C3k2, [512, False, 0.25]] 
  # - [-1, 6, C3k2_GhostV2, [512, False, 1, 0.25, 'attn']]
  - [-1, 1, SPPF, [512]]             

head:
  
  - [2, 1, Conv, [128, 1]]            
  - [4, 1, Conv, [256, 1]]            
  - [7, 1, Conv, [256, 1]]            


  - [-1, 1, DySample, []]             
  - [[-1, 9], 1, Concat, [1]]        
  - [-1, 2, C3k2_GhostV2, [256, False, 1, 0.25, 'attn']]      

  - [-1, 1, Conv, [128, 1, 1]]          
  

  - [-1, 1, DySample, []]             
  - [[-1, 8], 1, Concat, [1]]         
  - [-1, 2, C3k2_GhostV2, [128, False, 1, 0.25, 'original']]       

  - [13, 1, GhostConv, [256, 3, 2]]       
  - [[-1, 10], 1, Concat, [1]]        
  - [-1, 2, C3k2_GhostV2, [512, False, 1, 0.25, 'attn']]      

  - [[17, 13, 20], 1, Detect, [nc]]   
=======
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, FDD, [128]] 
  - [-1, 3, C3k2, [128, False, 0.25]] # p2(160x160)  # [2]
  - [-1, 1, FDD, [256]]        
  - [-1, 6, C3k2, [256, False, 0.25]] # p3(80x80) [4]
  - [-1, 1, Conv, [512, 3, 2]]  
  - [-1, 6, C3k2, [512, False, 0.25]] # p4(40x40)    
  - [-1, 1, SPPF, [512]]   # [7]

head:
  - [-1, 1, DySample, []]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]]    

  - [-1, 1, DySample, []]
  - [[-1, 2], 1, Concat, [1]] 
  - [-1, 2, C3k2, [128, False]] 

  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 10], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]]     


  - [-1, 1, Conv, [512, 3, 2]] 
  - [[-1, 7], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, True]]      

  - [[13, 16, 19], 1,  Detect, [nc]]
>>>>>>> a85b608541808a59c7235557facc85df239f31da
